bad
worst
great
waste
awful
excellent
terrible
waste_time
worse
boring
wonderful
best
stupid
nothing
one_best
poor
horrible
minutes
even
just
one_worst
love
crap
supposed
acting
poorly
perfect
plot
loved
script
ridiculous
amazing
lame
beautiful
worst_movie
avoid
superb
well
favorite
wasted
brilliant
annoying
oh
dull
mess
pointless
money
laughable
highly
cheap
life
8_10
pathetic
bad_acting
must_see
also
4_10
thing
least
10_10
7_10
badly
bad_movie
fantastic
unless
3_10
instead
beautifully
1_10
1
fails
2
redeeming
garbage
movie_bad
make
today
always
performance
enjoyed
anything
performances
reason
sorry
well_worth
save
looks_like
highly_recommend
years
9_10
touching
worst_film
2_10
predictable
wonderfully
outstanding
decent
bother
unfortunately
world
clichã
perfectly
strong
just_bad
3
highly_recommended
excuse
powerful
guess
ok
8
dumb
4
whatsoever
definitely
looks
better
terrific
low
attempt
unfunny
classic
unique
especially
still
gem
mean
idea
amateurish
7
look_like
wooden
sucks
heart
half
joke
job
either
true
masterpiece
subtle
time_money
lousy
trash
disappointment
recommended
different
apparently
great_film
great_movie
gives
dreadful
disappointing
mediocre
delightful
great_job
rubbish
atrocious
bunch
someone
underrated
painful
brilliantly
greatest
hour
bored
stunning
just_plain
none
incredible
watching
remotely
wrong
enjoyable
weak
movie_just
piece_crap
insult
captures
bland
looked
hilarious
completely
problem
works
well_done
will
war
wasting
finest
tedious
embarrassing
costs
fun
shows
crappy
oscar
memorable
moving
else
family
uninteresting
unbelievable
okay
trying
magnificent
lives
solid
fake
failed
friendship
refreshing
beauty
sweet
first_saw
silly
simple
stinker
something
realistic
journey
well_written
flat
pile
unconvincing
dialogue
forgettable
uninspired
much_better
rare
emotions
maybe
existent
terrible_movie
top_notch
remarkable
first_time
pretty_bad
enjoy
incoherent
recommend
complex
extraordinary
fascinating
0
loved_movie
absolutely_nothing
music
awesome
unwatchable
horribly
idiotic
miserably
perfection
definitely_worth
played
nowhere
tried
plays
portrayal
movie_terrible
love_movie
make_movie
except
unforgettable
human
random
tale
notch
fine
stay_away
favourite
barely
seconds
write
drivel
obviously
dvd
charming
mildly
fast_forward
lack
seemed
junk
intense
rent
flawless
asleep
irritating
brings
honestly
hours_life
superbly
premise
mst3k
favorites
spent
utter
embarrassed
series
experience
romantic
breathtaking
boredom
us
please
hoping
gorgeous
inept
enough
relationship
helps
also_great
paid
appalling
90_minutes
supposedly
horrid
excellent_film
funniest
although
nonsense
personal
9
make_sense
obvious
rented
lacks
point
stupidity
tries
whole_movie
shallow
save_money
wonderful_film
camera
god
movie_nothing
pretentious
basically
painfully
effort
turkey
timeless
marvelous
makes
later
pleasantly_surprised
rip
ashamed
atmosphere
also_good
unexpected
insulting
sucked
looking
blame
edge
b_movie
unlike
effective
liked
first_rate
even_worth
best_film
delight
may
noir
exceptional
ludicrous
tripe
haunting
worthless
new
city
gripping
provides
meets
rest
grade
quite
suppose
disaster
understated
care
cardboard
freedom
might
money_back
tragic
believe
useless
impressed
writing
entire_movie
unintentional
potential
really_enjoyed
appreciated
natural
nicely
treat
wonder
unintentionally
neither
ugly
available
edge_seat
adds
thin
writers
fabulous
tears
society
just_great
episodes
often
mystery_science
believable
made_sense
crafted
disappointed
downhill
gritty
ways
just_work
screaming
endless
sub_par
entertaining
score
unnecessary
nudity
compelling
genius
unusual
today's
miscast
thanks
cover
easy
somebody
just_right
favorite_movies
rest_movie
wanted_like
tells
skip
ages
even_get
shoot
others
obnoxious
moronic
contrived
sadness
producers
watchable
continuity
grade_d
original
felt_like
nevertheless
fresh
vhs
recently
become
beautiful_film
pitiful
surprised
trite
embarrassment
extremely_well
happiness
warm
stick
sensitive
sex
actors
t
nature
dimensional
skip_one
dreck
best_movie
like_watching
walked
bore
bothered
delivers
absurd
appreciate
keeps
surprisingly
ruined
late
yawn
ever
heartbreaking
ripped
alright
kidding
disgusting
truly
sometimes
spectacular
promising
films
jean
important
innocence
can_relate
brought
chilling
splendid
day
quiet
really_wanted
unrealistic
plan_9
confusing
masterful
touches
seems
sadly
terribly
one_funniest
fell_asleep
never_get_back
holds
otherwise
mystery_science_theater
excellently
riveting
well_acted
disjointed
thoroughly_enjoyed
one_good
times
shines
happy
give_1
overlooked
dire
season
tremendous
loved_film
still_great
muddled
satisfying
hooked
save_movie
turd
unlikeable
released
feel_good
chance
two_hours
see
steals_show
stock_footage
sake
stinks
paper
traditional
thought_provoking
fell_love
paint
unimaginative
viewings
enjoyed_movie
small
pleasure
courage
save_time
steals
fast_paced
project
embarrassingly
ugh
deals
none_characters
strength
filmmakers
entire
images
incomprehensible
surprising
takes
walking_around
love_film
portrait
soundtrack
together
seagal
makes_film
dreams
touched
reality
falls_flat
offensive
impact
lifeless
bit
moved
repetitive
acting_great
raw
hated
lot_fun
travesty
abomination
explained
makes_great
impressive
one_star
touch
gave_2
steaming
thrown
advice
accent
bottom_barrel
eerie
future
pleasant
hackneyed
unintentionally_funny
everyday
light
carries
want_see
spend_money
matthau
explores
ed_wood
barbara
insipid
give_3
better_movie
sharp
simplicity
blah
generic
plus_side
f
bin
wrenching
inappropriate
lacked
shelf
mystery_science_theater_3000
surreal
witty
lazy
frank
tries_hard
follows
lackluster
give_7
oh_wait
positive
engrossing
olds
delightfully
trying_hard
scientist
top
innocent
even_better
yet
supposed_comedy
film_school
miss
well_made
far
lacking
tender
twists_turns
definitely_recommend
sees
release
tiresome
comedies
unfolds
episode
dramas
consequences
inspiring
highly_entertaining
tasteless
stands
james_stewart
called
failure
main_problem
still_love
absolutely_sense
anyone_interested
simply
give_break
cried
really_liked
one_just
love_see
illogical
lovable
something_better
scary_movie
french
black_white
biggest_problem
even_close
tolerable
mesmerizing
ideal
run_around
annoyed
brutal
outer_space
goes_nowhere
cleverly
intelligent
saving
sitting
generous
astonishing
stupid_plot
enjoyable_film
throwing
joy_watch
value
wretched
tired
deserves
forwarding
inexplicably
rewarding
beautiful_movie
animated
worth_seeing
story_told
kudos
toilet
remembered
instead_1
mature
guilt
flimsy
hype
next_time
stunk
rating_8
dumber
director
find
deeper
saw_film
warmth
affection
dreary
living
twists
par
fears
seat
semi
bond
familiar
done_better
way_much
credibility
hardly
saved
good_job
overacting
movie_looks
great_show
choppy
mst3k_version
total_lack
wondering
sleep
frankly
nonetheless
high_hopes
absorbing
way_long
film_works
chance_see
essential
slow
wearing
genuine
alas
revolting
disgrace
nope
realizes
semblance
really_disappointed
quite_bad
inspired
subtitles
tense
inconsistent
troubled
saw
really_good
strongly
assume
really_enjoyed_movie
pedestrian
packed
deliciously
present
threw
part_movie
festival
may_seem
fits
based_true_story
back_enjoy
dvd_cover
tedium
awake
remake
draws
gradually
harrowing
glorious
detract
well_crafted
accents
also_shows
stilted
knowing
devotion
give_4
well_paced
restored
louis
pleased
franchise
inaccurate
frank_sinatra
look_forward
vapid
share
succeeds
fellow
devoid
lemmon
torn
kept_waiting
builds
whoever
work_art
every_time_watch
seem_like
motivation
plodding
made_tv
unappealing
little_sense
murder
enthralling
reminds
home
remember
steven_seagal
liked_movie
tony
along
ultimate
pseudo
urban
lost_interest
determination
conveniently
whole_film
concept
still_good
female
discovers
caught
just_made
meandering
pass
danny_devito
motions
nonexistent
bravo
sh_t
impeccable
hope_see
wider
marvellous
little_film
odyssey
third_rate
victims
45
international_film_festival
channel
left
surprisingly_good
black_guy
seamlessly
film_everyone
forced_watch
brazil
padding
felix
bleak
making_movie
finely
driven
want_see_good
movie_everyone
plods
similar
ham
soon
international
relaxed
horny
nice
saw_movie
moron
suspenseful
love_hate
read_book
collection
pleasant_surprise
sit_back
sisters
best_movie_ever
mediocrity
well_together
styles
use_term
footage
care_characters
eastwood
line
deal
raoul
just_seems
ever_since
dollar
lines_like
hong_kong
disappointed_movie
delicious
blues
bit_long
prince
bible
ride
magnificently
will_keep
sorrow
forward
turned
nothing_much
wanted_make
complaint
etc_etc
attention
rousing
definite
one_better
blatantly
get_copy
europe
